c5/src/ChartsOfCalculationTypes/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Taxes</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Taxes</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.Compensations</baseCalculationTypes>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.Calculations</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>FixedIncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>SocialInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/ChartsOfCalculationTypes/Taxes/Forms/Form/Module.bsl
&AtClient
var TableRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	readPictures ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readPictures ()
	
	for each row in Object.BaseCalculationTypes do
		setPicture ( row );
	enddo; 
	
EndProcedure 

&AtClientAtServerNoContext
Procedure setPicture ( Row )
	
	type = TypeOf ( Row.CalculationType );
	if ( type = Type ( "ChartOfCalculationTypesRef.Taxes" ) ) then
		picture = 1;
	else
		picture = 0;
	endif; 
	Row.Picture = picture;
	
EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	filterRates ();
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Base enable Object.Method <> Enum.Calculations.FixedAmount;
	|Write Warning show empty ( Object.Ref );
	|Method enable empty ( Object.Ref );
	|PayrollTaxes enable filled ( Object.Ref );
	|PayrollTaxesLimit show Object.Method = Enum.Calculations.IncomeTax;
	|ActualRates show ShowCurrentRates;
	|PayrollTaxes show not ShowCurrentRates
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure filterRates ()
	
	DC.SetFilter ( PayrollTaxes, "Tax", Object.Ref );
	DC.SetFilter ( ActualRates, "Tax", Object.Ref );
	
EndProcedure 

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	filterRates ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure MethodOnChange ( Item )
	
	PayrollItemForm.MethodOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DescriptionOnChange ( Item )
	
	PayrollItemForm.DescriptionOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure ShowActual ( Command )
	
	toggleRates ();
	
EndProcedure

&AtClient
Procedure toggleRates ()
	
	ShowCurrentRates = not ShowCurrentRates;
	Appearance.Apply ( ThisObject, "ShowCurrentRates" );
	
EndProcedure 

&AtClient
Procedure ShowRecords ( Command )
	
	toggleRates ()

EndProcedure

// *****************************************
// *********** Table Base

&AtClient
Procedure BaseOnActivateRow ( Item )
	
	TableRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure BaseCalculationTypeOnChange ( Item )
	
	setPicture ( TableRow );
	
EndProcedure
